FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_pio.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2014, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAM_PIO_COMPONENT_
#define _SAM_PIO_COMPONENT_

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR Parallel Input/Output Controller */
/* ============================================================================= */
/** \addtogroup SAM_PIO Parallel Input/Output Controller */
/*@{*/

#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
/** \brief Pio hardware registers */
    typedef struct
    {
        __O uint32_t PIO_PER;          /**< \brief (Pio Offset: 0x0000) PIO Enable Register */
        __O uint32_t PIO_PDR;          /**< \brief (Pio Offset: 0x0004) PIO Disable Register */
        __I uint32_t PIO_PSR;          /**< \brief (Pio Offset: 0x0008) PIO Status Register */
        __I uint32_t Reserved1[ 1 ];
        __O uint32_t PIO_OER;          /**< \brief (Pio Offset: 0x0010) Output Enable Register */
        __O uint32_t PIO_ODR;          /**< \brief (Pio Offset: 0x0014) Output Disable Register */
        __I uint32_t PIO_OSR;          /**< \brief (Pio Offset: 0x0018) Output Status Register */
        __I uint32_t Reserved2[ 1 ];
        __O uint32_t PIO_IFER;         /**< \brief (Pio Offset: 0x0020) Glitch Input Filter Enable Register */
        __O uint32_t PIO_IFDR;         /**< \brief (Pio Offset: 0x0024) Glitch Input Filter Disable Register */
        __I uint32_t PIO_IFSR;         /**< \brief (Pio Offset: 0x0028) Glitch Input Filter Status Register */
        __I uint32_t Reserved3[ 1 ];
        __O uint32_t PIO_SODR;         /**< \brief (Pio Offset: 0x0030) Set Output Data Register */
        __O uint32_t PIO_CODR;         /**< \brief (Pio Offset: 0x0034) Clear Output Data Register */
        __IO uint32_t PIO_ODSR;        /**< \brief (Pio Offset: 0x0038) Output Data Status Register */
        __I uint32_t PIO_PDSR;         /**< \brief (Pio Offset: 0x003C) Pin Data Status Register */
        __O uint32_t PIO_IER;          /**< \brief (Pio Offset: 0x0040) Interrupt Enable Register */
        __O uint32_t PIO_IDR;          /**< \brief (Pio Offset: 0x0044) Interrupt Disable Register */
        __I uint32_t PIO_IMR;          /**< \brief (Pio Offset: 0x0048) Interrupt Mask Register */
        __I uint32_t PIO_ISR;          /**< \brief (Pio Offset: 0x004C) Interrupt Status Register */
        __O uint32_t PIO_MDER;         /**< \brief (Pio Offset: 0x0050) Multi-driver Enable Register */
        __O uint32_t PIO_MDDR;         /**< \brief (Pio Offset: 0x0054) Multi-driver Disable Register */
        __I uint32_t PIO_MDSR;         /**< \brief (Pio Offset: 0x0058) Multi-driver Status Register */
        __I uint32_t Reserved4[ 1 ];
        __O uint32_t PIO_PUDR;         /**< \brief (Pio Offset: 0x0060) Pull-up Disable Register */
        __O uint32_t PIO_PUER;         /**< \brief (Pio Offset: 0x0064) Pull-up Enable Register */
        __I uint32_t PIO_PUSR;         /**< \brief (Pio Offset: 0x0068) Pad Pull-up Status Register */
        __I uint32_t Reserved5[ 1 ];
        __IO uint32_t PIO_ABCDSR[ 2 ]; /**< \brief (Pio Offset: 0x0070) Peripheral Select Register */
        __I uint32_t Reserved6[ 2 ];
        __O uint32_t PIO_IFSCDR;       /**< \brief (Pio Offset: 0x0080) Input Filter Slow Clock Disable Register */
        __O uint32_t PIO_IFSCER;       /**< \brief (Pio Offset: 0x0084) Input Filter Slow Clock Enable Register */
        __I uint32_t PIO_IFSCSR;       /**< \brief (Pio Offset: 0x0088) Input Filter Slow Clock Status Register */
        __IO uint32_t PIO_SCDR;        /**< \brief (Pio Offset: 0x008C) Slow Clock Divider Debouncing Register */
        __O uint32_t PIO_PPDDR;        /**< \brief (Pio Offset: 0x0090) Pad Pull-down Disable Register */
        __O uint32_t PIO_PPDER;        /**< \brief (Pio Offset: 0x0094) Pad Pull-down Enable Register */
        __I uint32_t PIO_PPDSR;        /**< \brief (Pio Offset: 0x0098) Pad Pull-down Status Register */
        __I uint32_t Reserved7[ 1 ];
        __O uint32_t PIO_OWER;         /**< \brief (Pio Offset: 0x00A0) Output Write Enable */
        __O uint32_t PIO_OWDR;         /**< \brief (Pio Offset: 0x00A4) Output Write Disable */
        __I uint32_t PIO_OWSR;         /**< \brief (Pio Offset: 0x00A8) Output Write Status Register */
        __I uint32_t Reserved8[ 1 ];
        __O uint32_t PIO_AIMER;        /**< \brief (Pio Offset: 0x00B0) Additional Interrupt Modes Enable Register */
        __O uint32_t PIO_AIMDR;        /**< \brief (Pio Offset: 0x00B4) Additional Interrupt Modes Disable Register */
        __I uint32_t PIO_AIMMR;        /**< \brief (Pio Offset: 0x00B8) Additional Interrupt Modes Mask Register */
        __I uint32_t Reserved9[ 1 ];
        __O uint32_t PIO_ESR;          /**< \brief (Pio Offset: 0x00C0) Edge Select Register */
        __O uint32_t PIO_LSR;          /**< \brief (Pio Offset: 0x00C4) Level Select Register */
        __I uint32_t PIO_ELSR;         /**< \brief (Pio Offset: 0x00C8) Edge/Level Status Register */
        __I uint32_t Reserved10[ 1 ];
        __O uint32_t PIO_FELLSR;       /**< \brief (Pio Offset: 0x00D0) Falling Edge/Low-Level Select Register */
        __O uint32_t PIO_REHLSR;       /**< \brief (Pio Offset: 0x00D4) Rising Edge/ High-Level Select Register */
        __I uint32_t PIO_FRLHSR;       /**< \brief (Pio Offset: 0x00D8) Fall/Rise - Low/High Status Register */
        __I uint32_t Reserved11[ 1 ];
        __I uint32_t PIO_LOCKSR;       /**< \brief (Pio Offset: 0x00E0) Lock Status */
        __IO uint32_t PIO_WPMR;        /**< \brief (Pio Offset: 0x00E4) Write Protection Mode Register */
        __I uint32_t PIO_WPSR;         /**< \brief (Pio Offset: 0x00E8) Write Protection Status Register */
        __I uint32_t Reserved12[ 4 ];
        __I uint32_t PIO_VERSION;      /**< \brief (Pio Offset: 0x00FC) Version Register */
        __IO uint32_t PIO_SCHMITT;     /**< \brief (Pio Offset: 0x0100) Schmitt Trigger Register */
        __I uint32_t Reserved13[ 7 ];
        __IO uint32_t PIO_KER;         /**< \brief (Pio Offset: 0x0120) Keypad Controller Enable Register */
        __IO uint32_t PIO_KRCR;        /**< \brief (Pio Offset: 0x0124) Keypad Controller Row Column Register */
        __IO uint32_t PIO_KDR;         /**< \brief (Pio Offset: 0x0128) Keypad Controller Debouncing Register */
        __I uint32_t Reserved14[ 1 ];
        __O uint32_t PIO_KIER;         /**< \brief (Pio Offset: 0x0130) Keypad Controller Interrupt Enable Register */
        __O uint32_t PIO_KIDR;         /**< \brief (Pio Offset: 0x0134) Keypad Controller Interrupt Disable Register */
        __I uint32_t PIO_KIMR;         /**< \brief (Pio Offset: 0x0138) Keypad Controller Interrupt Mask Register */
        __I uint32_t PIO_KSR;          /**< \brief (Pio Offset: 0x013C) Keypad Controller Status Register */
        __I uint32_t PIO_KKPR;         /**< \brief (Pio Offset: 0x0140) Keypad Controller Key Press Register */
        __I uint32_t PIO_KKRR;         /**< \brief (Pio Offset: 0x0144) Keypad Controller Key Release Register */
        __I uint32_t Reserved15[ 2 ];
        __IO uint32_t PIO_PCMR;        /**< \brief (Pio Offset: 0x150) Parallel Capture Mode Register */
        __O uint32_t PIO_PCIER;        /**< \brief (Pio Offset: 0x154) Parallel Capture Interrupt Enable Register */
        __O uint32_t PIO_PCIDR;        /**< \brief (Pio Offset: 0x158) Parallel Capture Interrupt Disable Register */
        __I uint32_t PIO_PCIMR;        /**< \brief (Pio Offset: 0x15C) Parallel Capture Interrupt Mask Register */
        __I uint32_t PIO_PCISR;        /**< \brief (Pio Offset: 0x160) Parallel Capture Interrupt Status Register */
        __I uint32_t PIO_PCRHR;        /**< \brief (Pio Offset: 0x164) Parallel Capture Reception Holding Register */
    } Pio;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* -------- PIO_PER : (PIO Offset: 0x0000) PIO Enable Register -------- */
#define PIO_PER_P0                   ( 0x1u << 0 )  /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P1                   ( 0x1u << 1 )  /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P2                   ( 0x1u << 2 )  /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P3                   ( 0x1u << 3 )  /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P4                   ( 0x1u << 4 )  /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P5                   ( 0x1u << 5 )  /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P6                   ( 0x1u << 6 )  /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P7                   ( 0x1u << 7 )  /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P8                   ( 0x1u << 8 )  /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P9                   ( 0x1u << 9 )  /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P10                  ( 0x1u << 10 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P11                  ( 0x1u << 11 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P12                  ( 0x1u << 12 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P13                  ( 0x1u << 13 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P14                  ( 0x1u << 14 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P15                  ( 0x1u << 15 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P16                  ( 0x1u << 16 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P17                  ( 0x1u << 17 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P18                  ( 0x1u << 18 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P19                  ( 0x1u << 19 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P20                  ( 0x1u << 20 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P21                  ( 0x1u << 21 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P22                  ( 0x1u << 22 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P23                  ( 0x1u << 23 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P24                  ( 0x1u << 24 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P25                  ( 0x1u << 25 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P26                  ( 0x1u << 26 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P27                  ( 0x1u << 27 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P28                  ( 0x1u << 28 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P29                  ( 0x1u << 29 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P30                  ( 0x1u << 30 ) /**< \brief (PIO_PER) PIO Enable */
#define PIO_PER_P31                  ( 0x1u << 31 ) /**< \brief (PIO_PER) PIO Enable */
/* -------- PIO_PDR : (PIO Offset: 0x0004) PIO Disable Register -------- */
#define PIO_PDR_P0                   ( 0x1u << 0 )  /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P1                   ( 0x1u << 1 )  /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P2                   ( 0x1u << 2 )  /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P3                   ( 0x1u << 3 )  /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P4                   ( 0x1u << 4 )  /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P5                   ( 0x1u << 5 )  /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P6                   ( 0x1u << 6 )  /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P7                   ( 0x1u << 7 )  /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P8                   ( 0x1u << 8 )  /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P9                   ( 0x1u << 9 )  /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P10                  ( 0x1u << 10 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P11                  ( 0x1u << 11 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P12                  ( 0x1u << 12 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P13                  ( 0x1u << 13 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P14                  ( 0x1u << 14 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P15                  ( 0x1u << 15 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P16                  ( 0x1u << 16 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P17                  ( 0x1u << 17 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P18                  ( 0x1u << 18 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P19                  ( 0x1u << 19 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P20                  ( 0x1u << 20 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P21                  ( 0x1u << 21 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P22                  ( 0x1u << 22 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P23                  ( 0x1u << 23 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P24                  ( 0x1u << 24 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P25                  ( 0x1u << 25 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P26                  ( 0x1u << 26 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P27                  ( 0x1u << 27 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P28                  ( 0x1u << 28 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P29                  ( 0x1u << 29 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P30                  ( 0x1u << 30 ) /**< \brief (PIO_PDR) PIO Disable */
#define PIO_PDR_P31                  ( 0x1u << 31 ) /**< \brief (PIO_PDR) PIO Disable */
/* -------- PIO_PSR : (PIO Offset: 0x0008) PIO Status Register -------- */
#define PIO_PSR_P0                   ( 0x1u << 0 )  /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P1                   ( 0x1u << 1 )  /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P2                   ( 0x1u << 2 )  /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P3                   ( 0x1u << 3 )  /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P4                   ( 0x1u << 4 )  /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P5                   ( 0x1u << 5 )  /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P6                   ( 0x1u << 6 )  /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P7                   ( 0x1u << 7 )  /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P8                   ( 0x1u << 8 )  /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P9                   ( 0x1u << 9 )  /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P10                  ( 0x1u << 10 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P11                  ( 0x1u << 11 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P12                  ( 0x1u << 12 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P13                  ( 0x1u << 13 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P14                  ( 0x1u << 14 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P15                  ( 0x1u << 15 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P16                  ( 0x1u << 16 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P17                  ( 0x1u << 17 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P18                  ( 0x1u << 18 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P19                  ( 0x1u << 19 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P20                  ( 0x1u << 20 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P21                  ( 0x1u << 21 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P22                  ( 0x1u << 22 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P23                  ( 0x1u << 23 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P24                  ( 0x1u << 24 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P25                  ( 0x1u << 25 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P26                  ( 0x1u << 26 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P27                  ( 0x1u << 27 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P28                  ( 0x1u << 28 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P29                  ( 0x1u << 29 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P30                  ( 0x1u << 30 ) /**< \brief (PIO_PSR) PIO Status */
#define PIO_PSR_P31                  ( 0x1u << 31 ) /**< \brief (PIO_PSR) PIO Status */
/* -------- PIO_OER : (PIO Offset: 0x0010) Output Enable Register -------- */
#define PIO_OER_P0                   ( 0x1u << 0 )  /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P1                   ( 0x1u << 1 )  /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P2                   ( 0x1u << 2 )  /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P3                   ( 0x1u << 3 )  /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P4                   ( 0x1u << 4 )  /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P5                   ( 0x1u << 5 )  /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P6                   ( 0x1u << 6 )  /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P7                   ( 0x1u << 7 )  /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P8                   ( 0x1u << 8 )  /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P9                   ( 0x1u << 9 )  /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P10                  ( 0x1u << 10 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P11                  ( 0x1u << 11 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P12                  ( 0x1u << 12 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P13                  ( 0x1u << 13 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P14                  ( 0x1u << 14 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P15                  ( 0x1u << 15 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P16                  ( 0x1u << 16 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P17                  ( 0x1u << 17 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P18                  ( 0x1u << 18 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P19                  ( 0x1u << 19 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P20                  ( 0x1u << 20 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P21                  ( 0x1u << 21 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P22                  ( 0x1u << 22 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P23                  ( 0x1u << 23 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P24                  ( 0x1u << 24 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P25                  ( 0x1u << 25 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P26                  ( 0x1u << 26 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P27                  ( 0x1u << 27 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P28                  ( 0x1u << 28 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P29                  ( 0x1u << 29 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P30                  ( 0x1u << 30 ) /**< \brief (PIO_OER) Output Enable */
#define PIO_OER_P31                  ( 0x1u << 31 ) /**< \brief (PIO_OER) Output Enable */
/* -------- PIO_ODR : (PIO Offset: 0x0014) Output Disable Register -------- */
#define PIO_ODR_P0                   ( 0x1u << 0 )  /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P1                   ( 0x1u << 1 )  /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P2                   ( 0x1u << 2 )  /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P3                   ( 0x1u << 3 )  /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P4                   ( 0x1u << 4 )  /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P5                   ( 0x1u << 5 )  /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P6                   ( 0x1u << 6 )  /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P7                   ( 0x1u << 7 )  /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P8                   ( 0x1u << 8 )  /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P9                   ( 0x1u << 9 )  /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P10                  ( 0x1u << 10 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P11                  ( 0x1u << 11 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P12                  ( 0x1u << 12 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P13                  ( 0x1u << 13 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P14                  ( 0x1u << 14 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P15                  ( 0x1u << 15 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P16                  ( 0x1u << 16 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P17                  ( 0x1u << 17 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P18                  ( 0x1u << 18 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P19                  ( 0x1u << 19 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P20                  ( 0x1u << 20 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P21                  ( 0x1u << 21 ) /**< \brief (PIO_ODR) Output Disable */
