FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_pio.h
#define PIO_ODR_P22                  ( 0x1u << 22 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P23                  ( 0x1u << 23 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P24                  ( 0x1u << 24 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P25                  ( 0x1u << 25 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P26                  ( 0x1u << 26 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P27                  ( 0x1u << 27 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P28                  ( 0x1u << 28 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P29                  ( 0x1u << 29 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P30                  ( 0x1u << 30 ) /**< \brief (PIO_ODR) Output Disable */
#define PIO_ODR_P31                  ( 0x1u << 31 ) /**< \brief (PIO_ODR) Output Disable */
/* -------- PIO_OSR : (PIO Offset: 0x0018) Output Status Register -------- */
#define PIO_OSR_P0                   ( 0x1u << 0 )  /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P1                   ( 0x1u << 1 )  /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P2                   ( 0x1u << 2 )  /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P3                   ( 0x1u << 3 )  /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P4                   ( 0x1u << 4 )  /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P5                   ( 0x1u << 5 )  /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P6                   ( 0x1u << 6 )  /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P7                   ( 0x1u << 7 )  /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P8                   ( 0x1u << 8 )  /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P9                   ( 0x1u << 9 )  /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P10                  ( 0x1u << 10 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P11                  ( 0x1u << 11 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P12                  ( 0x1u << 12 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P13                  ( 0x1u << 13 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P14                  ( 0x1u << 14 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P15                  ( 0x1u << 15 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P16                  ( 0x1u << 16 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P17                  ( 0x1u << 17 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P18                  ( 0x1u << 18 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P19                  ( 0x1u << 19 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P20                  ( 0x1u << 20 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P21                  ( 0x1u << 21 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P22                  ( 0x1u << 22 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P23                  ( 0x1u << 23 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P24                  ( 0x1u << 24 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P25                  ( 0x1u << 25 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P26                  ( 0x1u << 26 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P27                  ( 0x1u << 27 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P28                  ( 0x1u << 28 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P29                  ( 0x1u << 29 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P30                  ( 0x1u << 30 ) /**< \brief (PIO_OSR) Output Status */
#define PIO_OSR_P31                  ( 0x1u << 31 ) /**< \brief (PIO_OSR) Output Status */
/* -------- PIO_IFER : (PIO Offset: 0x0020) Glitch Input Filter Enable Register -------- */
#define PIO_IFER_P0                  ( 0x1u << 0 )  /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P1                  ( 0x1u << 1 )  /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P2                  ( 0x1u << 2 )  /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P3                  ( 0x1u << 3 )  /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P4                  ( 0x1u << 4 )  /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P5                  ( 0x1u << 5 )  /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P6                  ( 0x1u << 6 )  /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P7                  ( 0x1u << 7 )  /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P8                  ( 0x1u << 8 )  /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P9                  ( 0x1u << 9 )  /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P10                 ( 0x1u << 10 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P11                 ( 0x1u << 11 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P12                 ( 0x1u << 12 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P13                 ( 0x1u << 13 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P14                 ( 0x1u << 14 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P15                 ( 0x1u << 15 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P16                 ( 0x1u << 16 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P17                 ( 0x1u << 17 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P18                 ( 0x1u << 18 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P19                 ( 0x1u << 19 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P20                 ( 0x1u << 20 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P21                 ( 0x1u << 21 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P22                 ( 0x1u << 22 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P23                 ( 0x1u << 23 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P24                 ( 0x1u << 24 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P25                 ( 0x1u << 25 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P26                 ( 0x1u << 26 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P27                 ( 0x1u << 27 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P28                 ( 0x1u << 28 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P29                 ( 0x1u << 29 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P30                 ( 0x1u << 30 ) /**< \brief (PIO_IFER) Input Filter Enable */
#define PIO_IFER_P31                 ( 0x1u << 31 ) /**< \brief (PIO_IFER) Input Filter Enable */
/* -------- PIO_IFDR : (PIO Offset: 0x0024) Glitch Input Filter Disable Register -------- */
#define PIO_IFDR_P0                  ( 0x1u << 0 )  /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P1                  ( 0x1u << 1 )  /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P2                  ( 0x1u << 2 )  /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P3                  ( 0x1u << 3 )  /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P4                  ( 0x1u << 4 )  /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P5                  ( 0x1u << 5 )  /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P6                  ( 0x1u << 6 )  /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P7                  ( 0x1u << 7 )  /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P8                  ( 0x1u << 8 )  /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P9                  ( 0x1u << 9 )  /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P10                 ( 0x1u << 10 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P11                 ( 0x1u << 11 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P12                 ( 0x1u << 12 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P13                 ( 0x1u << 13 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P14                 ( 0x1u << 14 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P15                 ( 0x1u << 15 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P16                 ( 0x1u << 16 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P17                 ( 0x1u << 17 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P18                 ( 0x1u << 18 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P19                 ( 0x1u << 19 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P20                 ( 0x1u << 20 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P21                 ( 0x1u << 21 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P22                 ( 0x1u << 22 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P23                 ( 0x1u << 23 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P24                 ( 0x1u << 24 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P25                 ( 0x1u << 25 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P26                 ( 0x1u << 26 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P27                 ( 0x1u << 27 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P28                 ( 0x1u << 28 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P29                 ( 0x1u << 29 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P30                 ( 0x1u << 30 ) /**< \brief (PIO_IFDR) Input Filter Disable */
#define PIO_IFDR_P31                 ( 0x1u << 31 ) /**< \brief (PIO_IFDR) Input Filter Disable */
/* -------- PIO_IFSR : (PIO Offset: 0x0028) Glitch Input Filter Status Register -------- */
#define PIO_IFSR_P0                  ( 0x1u << 0 )  /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P1                  ( 0x1u << 1 )  /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P2                  ( 0x1u << 2 )  /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P3                  ( 0x1u << 3 )  /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P4                  ( 0x1u << 4 )  /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P5                  ( 0x1u << 5 )  /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P6                  ( 0x1u << 6 )  /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P7                  ( 0x1u << 7 )  /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P8                  ( 0x1u << 8 )  /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P9                  ( 0x1u << 9 )  /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P10                 ( 0x1u << 10 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P11                 ( 0x1u << 11 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P12                 ( 0x1u << 12 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P13                 ( 0x1u << 13 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P14                 ( 0x1u << 14 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P15                 ( 0x1u << 15 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P16                 ( 0x1u << 16 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P17                 ( 0x1u << 17 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P18                 ( 0x1u << 18 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P19                 ( 0x1u << 19 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P20                 ( 0x1u << 20 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P21                 ( 0x1u << 21 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P22                 ( 0x1u << 22 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P23                 ( 0x1u << 23 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P24                 ( 0x1u << 24 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P25                 ( 0x1u << 25 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P26                 ( 0x1u << 26 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P27                 ( 0x1u << 27 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P28                 ( 0x1u << 28 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P29                 ( 0x1u << 29 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P30                 ( 0x1u << 30 ) /**< \brief (PIO_IFSR) Input Filer Status */
#define PIO_IFSR_P31                 ( 0x1u << 31 ) /**< \brief (PIO_IFSR) Input Filer Status */
/* -------- PIO_SODR : (PIO Offset: 0x0030) Set Output Data Register -------- */
#define PIO_SODR_P0                  ( 0x1u << 0 )  /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P1                  ( 0x1u << 1 )  /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P2                  ( 0x1u << 2 )  /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P3                  ( 0x1u << 3 )  /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P4                  ( 0x1u << 4 )  /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P5                  ( 0x1u << 5 )  /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P6                  ( 0x1u << 6 )  /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P7                  ( 0x1u << 7 )  /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P8                  ( 0x1u << 8 )  /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P9                  ( 0x1u << 9 )  /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P10                 ( 0x1u << 10 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P11                 ( 0x1u << 11 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P12                 ( 0x1u << 12 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P13                 ( 0x1u << 13 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P14                 ( 0x1u << 14 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P15                 ( 0x1u << 15 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P16                 ( 0x1u << 16 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P17                 ( 0x1u << 17 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P18                 ( 0x1u << 18 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P19                 ( 0x1u << 19 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P20                 ( 0x1u << 20 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P21                 ( 0x1u << 21 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P22                 ( 0x1u << 22 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P23                 ( 0x1u << 23 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P24                 ( 0x1u << 24 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P25                 ( 0x1u << 25 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P26                 ( 0x1u << 26 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P27                 ( 0x1u << 27 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P28                 ( 0x1u << 28 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P29                 ( 0x1u << 29 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P30                 ( 0x1u << 30 ) /**< \brief (PIO_SODR) Set Output Data */
#define PIO_SODR_P31                 ( 0x1u << 31 ) /**< \brief (PIO_SODR) Set Output Data */
/* -------- PIO_CODR : (PIO Offset: 0x0034) Clear Output Data Register -------- */
#define PIO_CODR_P0                  ( 0x1u << 0 )  /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P1                  ( 0x1u << 1 )  /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P2                  ( 0x1u << 2 )  /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P3                  ( 0x1u << 3 )  /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P4                  ( 0x1u << 4 )  /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P5                  ( 0x1u << 5 )  /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P6                  ( 0x1u << 6 )  /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P7                  ( 0x1u << 7 )  /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P8                  ( 0x1u << 8 )  /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P9                  ( 0x1u << 9 )  /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P10                 ( 0x1u << 10 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P11                 ( 0x1u << 11 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P12                 ( 0x1u << 12 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P13                 ( 0x1u << 13 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P14                 ( 0x1u << 14 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P15                 ( 0x1u << 15 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P16                 ( 0x1u << 16 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P17                 ( 0x1u << 17 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P18                 ( 0x1u << 18 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P19                 ( 0x1u << 19 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P20                 ( 0x1u << 20 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P21                 ( 0x1u << 21 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P22                 ( 0x1u << 22 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P23                 ( 0x1u << 23 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P24                 ( 0x1u << 24 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P25                 ( 0x1u << 25 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P26                 ( 0x1u << 26 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P27                 ( 0x1u << 27 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P28                 ( 0x1u << 28 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P29                 ( 0x1u << 29 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P30                 ( 0x1u << 30 ) /**< \brief (PIO_CODR) Clear Output Data */
#define PIO_CODR_P31                 ( 0x1u << 31 ) /**< \brief (PIO_CODR) Clear Output Data */
/* -------- PIO_ODSR : (PIO Offset: 0x0038) Output Data Status Register -------- */
#define PIO_ODSR_P0                  ( 0x1u << 0 )  /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P1                  ( 0x1u << 1 )  /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P2                  ( 0x1u << 2 )  /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P3                  ( 0x1u << 3 )  /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P4                  ( 0x1u << 4 )  /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P5                  ( 0x1u << 5 )  /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P6                  ( 0x1u << 6 )  /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P7                  ( 0x1u << 7 )  /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P8                  ( 0x1u << 8 )  /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P9                  ( 0x1u << 9 )  /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P10                 ( 0x1u << 10 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P11                 ( 0x1u << 11 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P12                 ( 0x1u << 12 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P13                 ( 0x1u << 13 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P14                 ( 0x1u << 14 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P15                 ( 0x1u << 15 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P16                 ( 0x1u << 16 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P17                 ( 0x1u << 17 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P18                 ( 0x1u << 18 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P19                 ( 0x1u << 19 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P20                 ( 0x1u << 20 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P21                 ( 0x1u << 21 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P22                 ( 0x1u << 22 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P23                 ( 0x1u << 23 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P24                 ( 0x1u << 24 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P25                 ( 0x1u << 25 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P26                 ( 0x1u << 26 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P27                 ( 0x1u << 27 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P28                 ( 0x1u << 28 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P29                 ( 0x1u << 29 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P30                 ( 0x1u << 30 ) /**< \brief (PIO_ODSR) Output Data Status */
#define PIO_ODSR_P31                 ( 0x1u << 31 ) /**< \brief (PIO_ODSR) Output Data Status */
/* -------- PIO_PDSR : (PIO Offset: 0x003C) Pin Data Status Register -------- */
#define PIO_PDSR_P0                  ( 0x1u << 0 )  /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P1                  ( 0x1u << 1 )  /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P2                  ( 0x1u << 2 )  /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P3                  ( 0x1u << 3 )  /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P4                  ( 0x1u << 4 )  /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P5                  ( 0x1u << 5 )  /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P6                  ( 0x1u << 6 )  /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P7                  ( 0x1u << 7 )  /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P8                  ( 0x1u << 8 )  /**< \brief (PIO_PDSR) Output Data Status */
