FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_pio.h
#define PIO_PDSR_P9                  ( 0x1u << 9 )  /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P10                 ( 0x1u << 10 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P11                 ( 0x1u << 11 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P12                 ( 0x1u << 12 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P13                 ( 0x1u << 13 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P14                 ( 0x1u << 14 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P15                 ( 0x1u << 15 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P16                 ( 0x1u << 16 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P17                 ( 0x1u << 17 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P18                 ( 0x1u << 18 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P19                 ( 0x1u << 19 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P20                 ( 0x1u << 20 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P21                 ( 0x1u << 21 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P22                 ( 0x1u << 22 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P23                 ( 0x1u << 23 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P24                 ( 0x1u << 24 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P25                 ( 0x1u << 25 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P26                 ( 0x1u << 26 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P27                 ( 0x1u << 27 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P28                 ( 0x1u << 28 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P29                 ( 0x1u << 29 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P30                 ( 0x1u << 30 ) /**< \brief (PIO_PDSR) Output Data Status */
#define PIO_PDSR_P31                 ( 0x1u << 31 ) /**< \brief (PIO_PDSR) Output Data Status */
/* -------- PIO_IER : (PIO Offset: 0x0040) Interrupt Enable Register -------- */
#define PIO_IER_P0                   ( 0x1u << 0 )  /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P1                   ( 0x1u << 1 )  /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P2                   ( 0x1u << 2 )  /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P3                   ( 0x1u << 3 )  /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P4                   ( 0x1u << 4 )  /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P5                   ( 0x1u << 5 )  /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P6                   ( 0x1u << 6 )  /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P7                   ( 0x1u << 7 )  /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P8                   ( 0x1u << 8 )  /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P9                   ( 0x1u << 9 )  /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P10                  ( 0x1u << 10 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P11                  ( 0x1u << 11 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P12                  ( 0x1u << 12 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P13                  ( 0x1u << 13 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P14                  ( 0x1u << 14 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P15                  ( 0x1u << 15 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P16                  ( 0x1u << 16 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P17                  ( 0x1u << 17 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P18                  ( 0x1u << 18 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P19                  ( 0x1u << 19 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P20                  ( 0x1u << 20 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P21                  ( 0x1u << 21 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P22                  ( 0x1u << 22 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P23                  ( 0x1u << 23 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P24                  ( 0x1u << 24 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P25                  ( 0x1u << 25 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P26                  ( 0x1u << 26 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P27                  ( 0x1u << 27 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P28                  ( 0x1u << 28 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P29                  ( 0x1u << 29 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P30                  ( 0x1u << 30 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
#define PIO_IER_P31                  ( 0x1u << 31 ) /**< \brief (PIO_IER) Input Change Interrupt Enable */
/* -------- PIO_IDR : (PIO Offset: 0x0044) Interrupt Disable Register -------- */
#define PIO_IDR_P0                   ( 0x1u << 0 )  /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P1                   ( 0x1u << 1 )  /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P2                   ( 0x1u << 2 )  /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P3                   ( 0x1u << 3 )  /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P4                   ( 0x1u << 4 )  /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P5                   ( 0x1u << 5 )  /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P6                   ( 0x1u << 6 )  /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P7                   ( 0x1u << 7 )  /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P8                   ( 0x1u << 8 )  /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P9                   ( 0x1u << 9 )  /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P10                  ( 0x1u << 10 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P11                  ( 0x1u << 11 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P12                  ( 0x1u << 12 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P13                  ( 0x1u << 13 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P14                  ( 0x1u << 14 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P15                  ( 0x1u << 15 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P16                  ( 0x1u << 16 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P17                  ( 0x1u << 17 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P18                  ( 0x1u << 18 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P19                  ( 0x1u << 19 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P20                  ( 0x1u << 20 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P21                  ( 0x1u << 21 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P22                  ( 0x1u << 22 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P23                  ( 0x1u << 23 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P24                  ( 0x1u << 24 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P25                  ( 0x1u << 25 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P26                  ( 0x1u << 26 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P27                  ( 0x1u << 27 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P28                  ( 0x1u << 28 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P29                  ( 0x1u << 29 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P30                  ( 0x1u << 30 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
#define PIO_IDR_P31                  ( 0x1u << 31 ) /**< \brief (PIO_IDR) Input Change Interrupt Disable */
/* -------- PIO_IMR : (PIO Offset: 0x0048) Interrupt Mask Register -------- */
#define PIO_IMR_P0                   ( 0x1u << 0 )  /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P1                   ( 0x1u << 1 )  /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P2                   ( 0x1u << 2 )  /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P3                   ( 0x1u << 3 )  /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P4                   ( 0x1u << 4 )  /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P5                   ( 0x1u << 5 )  /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P6                   ( 0x1u << 6 )  /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P7                   ( 0x1u << 7 )  /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P8                   ( 0x1u << 8 )  /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P9                   ( 0x1u << 9 )  /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P10                  ( 0x1u << 10 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P11                  ( 0x1u << 11 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P12                  ( 0x1u << 12 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P13                  ( 0x1u << 13 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P14                  ( 0x1u << 14 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P15                  ( 0x1u << 15 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P16                  ( 0x1u << 16 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P17                  ( 0x1u << 17 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P18                  ( 0x1u << 18 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P19                  ( 0x1u << 19 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P20                  ( 0x1u << 20 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P21                  ( 0x1u << 21 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P22                  ( 0x1u << 22 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P23                  ( 0x1u << 23 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P24                  ( 0x1u << 24 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P25                  ( 0x1u << 25 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P26                  ( 0x1u << 26 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P27                  ( 0x1u << 27 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P28                  ( 0x1u << 28 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P29                  ( 0x1u << 29 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P30                  ( 0x1u << 30 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
#define PIO_IMR_P31                  ( 0x1u << 31 ) /**< \brief (PIO_IMR) Input Change Interrupt Mask */
/* -------- PIO_ISR : (PIO Offset: 0x004C) Interrupt Status Register -------- */
#define PIO_ISR_P0                   ( 0x1u << 0 )  /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P1                   ( 0x1u << 1 )  /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P2                   ( 0x1u << 2 )  /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P3                   ( 0x1u << 3 )  /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P4                   ( 0x1u << 4 )  /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P5                   ( 0x1u << 5 )  /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P6                   ( 0x1u << 6 )  /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P7                   ( 0x1u << 7 )  /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P8                   ( 0x1u << 8 )  /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P9                   ( 0x1u << 9 )  /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P10                  ( 0x1u << 10 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P11                  ( 0x1u << 11 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P12                  ( 0x1u << 12 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P13                  ( 0x1u << 13 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P14                  ( 0x1u << 14 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P15                  ( 0x1u << 15 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P16                  ( 0x1u << 16 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P17                  ( 0x1u << 17 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P18                  ( 0x1u << 18 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P19                  ( 0x1u << 19 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P20                  ( 0x1u << 20 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P21                  ( 0x1u << 21 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P22                  ( 0x1u << 22 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P23                  ( 0x1u << 23 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P24                  ( 0x1u << 24 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P25                  ( 0x1u << 25 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P26                  ( 0x1u << 26 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P27                  ( 0x1u << 27 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P28                  ( 0x1u << 28 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P29                  ( 0x1u << 29 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P30                  ( 0x1u << 30 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
#define PIO_ISR_P31                  ( 0x1u << 31 ) /**< \brief (PIO_ISR) Input Change Interrupt Status */
/* -------- PIO_MDER : (PIO Offset: 0x0050) Multi-driver Enable Register -------- */
#define PIO_MDER_P0                  ( 0x1u << 0 )  /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P1                  ( 0x1u << 1 )  /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P2                  ( 0x1u << 2 )  /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P3                  ( 0x1u << 3 )  /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P4                  ( 0x1u << 4 )  /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P5                  ( 0x1u << 5 )  /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P6                  ( 0x1u << 6 )  /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P7                  ( 0x1u << 7 )  /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P8                  ( 0x1u << 8 )  /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P9                  ( 0x1u << 9 )  /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P10                 ( 0x1u << 10 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P11                 ( 0x1u << 11 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P12                 ( 0x1u << 12 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P13                 ( 0x1u << 13 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P14                 ( 0x1u << 14 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P15                 ( 0x1u << 15 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P16                 ( 0x1u << 16 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P17                 ( 0x1u << 17 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P18                 ( 0x1u << 18 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P19                 ( 0x1u << 19 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P20                 ( 0x1u << 20 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P21                 ( 0x1u << 21 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P22                 ( 0x1u << 22 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P23                 ( 0x1u << 23 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P24                 ( 0x1u << 24 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P25                 ( 0x1u << 25 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P26                 ( 0x1u << 26 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P27                 ( 0x1u << 27 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P28                 ( 0x1u << 28 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P29                 ( 0x1u << 29 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P30                 ( 0x1u << 30 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
#define PIO_MDER_P31                 ( 0x1u << 31 ) /**< \brief (PIO_MDER) Multi-Drive Enable */
/* -------- PIO_MDDR : (PIO Offset: 0x0054) Multi-driver Disable Register -------- */
#define PIO_MDDR_P0                  ( 0x1u << 0 )  /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P1                  ( 0x1u << 1 )  /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P2                  ( 0x1u << 2 )  /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P3                  ( 0x1u << 3 )  /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P4                  ( 0x1u << 4 )  /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P5                  ( 0x1u << 5 )  /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P6                  ( 0x1u << 6 )  /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P7                  ( 0x1u << 7 )  /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P8                  ( 0x1u << 8 )  /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P9                  ( 0x1u << 9 )  /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P10                 ( 0x1u << 10 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P11                 ( 0x1u << 11 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P12                 ( 0x1u << 12 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P13                 ( 0x1u << 13 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P14                 ( 0x1u << 14 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P15                 ( 0x1u << 15 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P16                 ( 0x1u << 16 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P17                 ( 0x1u << 17 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P18                 ( 0x1u << 18 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P19                 ( 0x1u << 19 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P20                 ( 0x1u << 20 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P21                 ( 0x1u << 21 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P22                 ( 0x1u << 22 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P23                 ( 0x1u << 23 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P24                 ( 0x1u << 24 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P25                 ( 0x1u << 25 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P26                 ( 0x1u << 26 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P27                 ( 0x1u << 27 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P28                 ( 0x1u << 28 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P29                 ( 0x1u << 29 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P30                 ( 0x1u << 30 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
#define PIO_MDDR_P31                 ( 0x1u << 31 ) /**< \brief (PIO_MDDR) Multi-Drive Disable */
/* -------- PIO_MDSR : (PIO Offset: 0x0058) Multi-driver Status Register -------- */
#define PIO_MDSR_P0                  ( 0x1u << 0 )  /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P1                  ( 0x1u << 1 )  /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P2                  ( 0x1u << 2 )  /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P3                  ( 0x1u << 3 )  /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P4                  ( 0x1u << 4 )  /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P5                  ( 0x1u << 5 )  /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P6                  ( 0x1u << 6 )  /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P7                  ( 0x1u << 7 )  /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P8                  ( 0x1u << 8 )  /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P9                  ( 0x1u << 9 )  /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P10                 ( 0x1u << 10 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P11                 ( 0x1u << 11 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P12                 ( 0x1u << 12 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
