FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_pio.h
#define PIO_MDSR_P13                 ( 0x1u << 13 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P14                 ( 0x1u << 14 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P15                 ( 0x1u << 15 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P16                 ( 0x1u << 16 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P17                 ( 0x1u << 17 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P18                 ( 0x1u << 18 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P19                 ( 0x1u << 19 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P20                 ( 0x1u << 20 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P21                 ( 0x1u << 21 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P22                 ( 0x1u << 22 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P23                 ( 0x1u << 23 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P24                 ( 0x1u << 24 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P25                 ( 0x1u << 25 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P26                 ( 0x1u << 26 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P27                 ( 0x1u << 27 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P28                 ( 0x1u << 28 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P29                 ( 0x1u << 29 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P30                 ( 0x1u << 30 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
#define PIO_MDSR_P31                 ( 0x1u << 31 ) /**< \brief (PIO_MDSR) Multi-Drive Status */
/* -------- PIO_PUDR : (PIO Offset: 0x0060) Pull-up Disable Register -------- */
#define PIO_PUDR_P0                  ( 0x1u << 0 )  /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P1                  ( 0x1u << 1 )  /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P2                  ( 0x1u << 2 )  /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P3                  ( 0x1u << 3 )  /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P4                  ( 0x1u << 4 )  /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P5                  ( 0x1u << 5 )  /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P6                  ( 0x1u << 6 )  /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P7                  ( 0x1u << 7 )  /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P8                  ( 0x1u << 8 )  /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P9                  ( 0x1u << 9 )  /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P10                 ( 0x1u << 10 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P11                 ( 0x1u << 11 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P12                 ( 0x1u << 12 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P13                 ( 0x1u << 13 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P14                 ( 0x1u << 14 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P15                 ( 0x1u << 15 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P16                 ( 0x1u << 16 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P17                 ( 0x1u << 17 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P18                 ( 0x1u << 18 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P19                 ( 0x1u << 19 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P20                 ( 0x1u << 20 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P21                 ( 0x1u << 21 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P22                 ( 0x1u << 22 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P23                 ( 0x1u << 23 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P24                 ( 0x1u << 24 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P25                 ( 0x1u << 25 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P26                 ( 0x1u << 26 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P27                 ( 0x1u << 27 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P28                 ( 0x1u << 28 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P29                 ( 0x1u << 29 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P30                 ( 0x1u << 30 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
#define PIO_PUDR_P31                 ( 0x1u << 31 ) /**< \brief (PIO_PUDR) Pull-Up Disable */
/* -------- PIO_PUER : (PIO Offset: 0x0064) Pull-up Enable Register -------- */
#define PIO_PUER_P0                  ( 0x1u << 0 )  /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P1                  ( 0x1u << 1 )  /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P2                  ( 0x1u << 2 )  /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P3                  ( 0x1u << 3 )  /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P4                  ( 0x1u << 4 )  /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P5                  ( 0x1u << 5 )  /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P6                  ( 0x1u << 6 )  /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P7                  ( 0x1u << 7 )  /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P8                  ( 0x1u << 8 )  /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P9                  ( 0x1u << 9 )  /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P10                 ( 0x1u << 10 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P11                 ( 0x1u << 11 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P12                 ( 0x1u << 12 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P13                 ( 0x1u << 13 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P14                 ( 0x1u << 14 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P15                 ( 0x1u << 15 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P16                 ( 0x1u << 16 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P17                 ( 0x1u << 17 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P18                 ( 0x1u << 18 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P19                 ( 0x1u << 19 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P20                 ( 0x1u << 20 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P21                 ( 0x1u << 21 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P22                 ( 0x1u << 22 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P23                 ( 0x1u << 23 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P24                 ( 0x1u << 24 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P25                 ( 0x1u << 25 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P26                 ( 0x1u << 26 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P27                 ( 0x1u << 27 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P28                 ( 0x1u << 28 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P29                 ( 0x1u << 29 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P30                 ( 0x1u << 30 ) /**< \brief (PIO_PUER) Pull-Up Enable */
#define PIO_PUER_P31                 ( 0x1u << 31 ) /**< \brief (PIO_PUER) Pull-Up Enable */
/* -------- PIO_PUSR : (PIO Offset: 0x0068) Pad Pull-up Status Register -------- */
#define PIO_PUSR_P0                  ( 0x1u << 0 )  /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P1                  ( 0x1u << 1 )  /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P2                  ( 0x1u << 2 )  /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P3                  ( 0x1u << 3 )  /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P4                  ( 0x1u << 4 )  /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P5                  ( 0x1u << 5 )  /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P6                  ( 0x1u << 6 )  /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P7                  ( 0x1u << 7 )  /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P8                  ( 0x1u << 8 )  /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P9                  ( 0x1u << 9 )  /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P10                 ( 0x1u << 10 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P11                 ( 0x1u << 11 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P12                 ( 0x1u << 12 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P13                 ( 0x1u << 13 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P14                 ( 0x1u << 14 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P15                 ( 0x1u << 15 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P16                 ( 0x1u << 16 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P17                 ( 0x1u << 17 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P18                 ( 0x1u << 18 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P19                 ( 0x1u << 19 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P20                 ( 0x1u << 20 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P21                 ( 0x1u << 21 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P22                 ( 0x1u << 22 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P23                 ( 0x1u << 23 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P24                 ( 0x1u << 24 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P25                 ( 0x1u << 25 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P26                 ( 0x1u << 26 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P27                 ( 0x1u << 27 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P28                 ( 0x1u << 28 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P29                 ( 0x1u << 29 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P30                 ( 0x1u << 30 ) /**< \brief (PIO_PUSR) Pull-Up Status */
#define PIO_PUSR_P31                 ( 0x1u << 31 ) /**< \brief (PIO_PUSR) Pull-Up Status */
/* -------- PIO_ABCDSR[2] : (PIO Offset: 0x0070) Peripheral Select Register -------- */
#define PIO_ABCDSR_P0                ( 0x1u << 0 )  /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P1                ( 0x1u << 1 )  /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P2                ( 0x1u << 2 )  /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P3                ( 0x1u << 3 )  /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P4                ( 0x1u << 4 )  /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P5                ( 0x1u << 5 )  /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P6                ( 0x1u << 6 )  /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P7                ( 0x1u << 7 )  /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P8                ( 0x1u << 8 )  /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P9                ( 0x1u << 9 )  /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P10               ( 0x1u << 10 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P11               ( 0x1u << 11 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P12               ( 0x1u << 12 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P13               ( 0x1u << 13 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P14               ( 0x1u << 14 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P15               ( 0x1u << 15 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P16               ( 0x1u << 16 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P17               ( 0x1u << 17 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P18               ( 0x1u << 18 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P19               ( 0x1u << 19 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P20               ( 0x1u << 20 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P21               ( 0x1u << 21 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P22               ( 0x1u << 22 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P23               ( 0x1u << 23 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P24               ( 0x1u << 24 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P25               ( 0x1u << 25 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P26               ( 0x1u << 26 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P27               ( 0x1u << 27 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P28               ( 0x1u << 28 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P29               ( 0x1u << 29 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P30               ( 0x1u << 30 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
#define PIO_ABCDSR_P31               ( 0x1u << 31 ) /**< \brief (PIO_ABCDSR[2]) Peripheral Select */
/* -------- PIO_IFSCDR : (PIO Offset: 0x0080) Input Filter Slow Clock Disable Register -------- */
#define PIO_IFSCDR_P0                ( 0x1u << 0 )  /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P1                ( 0x1u << 1 )  /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P2                ( 0x1u << 2 )  /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P3                ( 0x1u << 3 )  /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P4                ( 0x1u << 4 )  /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P5                ( 0x1u << 5 )  /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P6                ( 0x1u << 6 )  /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P7                ( 0x1u << 7 )  /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P8                ( 0x1u << 8 )  /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P9                ( 0x1u << 9 )  /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P10               ( 0x1u << 10 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P11               ( 0x1u << 11 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P12               ( 0x1u << 12 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P13               ( 0x1u << 13 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P14               ( 0x1u << 14 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P15               ( 0x1u << 15 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P16               ( 0x1u << 16 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P17               ( 0x1u << 17 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P18               ( 0x1u << 18 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P19               ( 0x1u << 19 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P20               ( 0x1u << 20 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P21               ( 0x1u << 21 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P22               ( 0x1u << 22 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P23               ( 0x1u << 23 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P24               ( 0x1u << 24 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P25               ( 0x1u << 25 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P26               ( 0x1u << 26 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P27               ( 0x1u << 27 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P28               ( 0x1u << 28 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P29               ( 0x1u << 29 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P30               ( 0x1u << 30 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
#define PIO_IFSCDR_P31               ( 0x1u << 31 ) /**< \brief (PIO_IFSCDR) PIO Clock Glitch Filtering Select */
/* -------- PIO_IFSCER : (PIO Offset: 0x0084) Input Filter Slow Clock Enable Register -------- */
#define PIO_IFSCER_P0                ( 0x1u << 0 )  /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P1                ( 0x1u << 1 )  /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P2                ( 0x1u << 2 )  /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P3                ( 0x1u << 3 )  /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P4                ( 0x1u << 4 )  /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P5                ( 0x1u << 5 )  /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P6                ( 0x1u << 6 )  /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P7                ( 0x1u << 7 )  /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P8                ( 0x1u << 8 )  /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P9                ( 0x1u << 9 )  /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P10               ( 0x1u << 10 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P11               ( 0x1u << 11 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P12               ( 0x1u << 12 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P13               ( 0x1u << 13 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P14               ( 0x1u << 14 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P15               ( 0x1u << 15 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P16               ( 0x1u << 16 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P17               ( 0x1u << 17 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P18               ( 0x1u << 18 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P19               ( 0x1u << 19 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P20               ( 0x1u << 20 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P21               ( 0x1u << 21 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P22               ( 0x1u << 22 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P23               ( 0x1u << 23 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P24               ( 0x1u << 24 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P25               ( 0x1u << 25 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P26               ( 0x1u << 26 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P27               ( 0x1u << 27 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P28               ( 0x1u << 28 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P29               ( 0x1u << 29 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P30               ( 0x1u << 30 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
#define PIO_IFSCER_P31               ( 0x1u << 31 ) /**< \brief (PIO_IFSCER) Debouncing Filtering Select */
/* -------- PIO_IFSCSR : (PIO Offset: 0x0088) Input Filter Slow Clock Status Register -------- */
#define PIO_IFSCSR_P0                ( 0x1u << 0 )  /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P1                ( 0x1u << 1 )  /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P2                ( 0x1u << 2 )  /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P3                ( 0x1u << 3 )  /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P4                ( 0x1u << 4 )  /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P5                ( 0x1u << 5 )  /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P6                ( 0x1u << 6 )  /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P7                ( 0x1u << 7 )  /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P8                ( 0x1u << 8 )  /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P9                ( 0x1u << 9 )  /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P10               ( 0x1u << 10 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P11               ( 0x1u << 11 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P12               ( 0x1u << 12 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P13               ( 0x1u << 13 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P14               ( 0x1u << 14 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P15               ( 0x1u << 15 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P16               ( 0x1u << 16 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
