FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_pio.h
#define PIO_IFSCSR_P17               ( 0x1u << 17 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P18               ( 0x1u << 18 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P19               ( 0x1u << 19 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P20               ( 0x1u << 20 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P21               ( 0x1u << 21 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P22               ( 0x1u << 22 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P23               ( 0x1u << 23 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P24               ( 0x1u << 24 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P25               ( 0x1u << 25 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P26               ( 0x1u << 26 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P27               ( 0x1u << 27 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P28               ( 0x1u << 28 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P29               ( 0x1u << 29 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P30               ( 0x1u << 30 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
#define PIO_IFSCSR_P31               ( 0x1u << 31 ) /**< \brief (PIO_IFSCSR) Glitch or Debouncing Filter Selection Status */
/* -------- PIO_SCDR : (PIO Offset: 0x008C) Slow Clock Divider Debouncing Register -------- */
#define PIO_SCDR_DIV_Pos             0
#define PIO_SCDR_DIV_Msk             ( 0x3fffu << PIO_SCDR_DIV_Pos ) /**< \brief (PIO_SCDR) Slow Clock Divider Selection for Debouncing */
#define PIO_SCDR_DIV( value )    ( ( PIO_SCDR_DIV_Msk & ( ( value ) << PIO_SCDR_DIV_Pos ) ) )
/* -------- PIO_PPDDR : (PIO Offset: 0x0090) Pad Pull-down Disable Register -------- */
#define PIO_PPDDR_P0                 ( 0x1u << 0 )                       /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P1                 ( 0x1u << 1 )                       /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P2                 ( 0x1u << 2 )                       /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P3                 ( 0x1u << 3 )                       /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P4                 ( 0x1u << 4 )                       /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P5                 ( 0x1u << 5 )                       /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P6                 ( 0x1u << 6 )                       /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P7                 ( 0x1u << 7 )                       /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P8                 ( 0x1u << 8 )                       /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P9                 ( 0x1u << 9 )                       /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P10                ( 0x1u << 10 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P11                ( 0x1u << 11 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P12                ( 0x1u << 12 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P13                ( 0x1u << 13 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P14                ( 0x1u << 14 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P15                ( 0x1u << 15 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P16                ( 0x1u << 16 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P17                ( 0x1u << 17 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P18                ( 0x1u << 18 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P19                ( 0x1u << 19 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P20                ( 0x1u << 20 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P21                ( 0x1u << 21 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P22                ( 0x1u << 22 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P23                ( 0x1u << 23 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P24                ( 0x1u << 24 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P25                ( 0x1u << 25 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P26                ( 0x1u << 26 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P27                ( 0x1u << 27 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P28                ( 0x1u << 28 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P29                ( 0x1u << 29 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P30                ( 0x1u << 30 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
#define PIO_PPDDR_P31                ( 0x1u << 31 )                      /**< \brief (PIO_PPDDR) Pull-Down Disable */
/* -------- PIO_PPDER : (PIO Offset: 0x0094) Pad Pull-down Enable Register -------- */
#define PIO_PPDER_P0                 ( 0x1u << 0 )                       /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P1                 ( 0x1u << 1 )                       /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P2                 ( 0x1u << 2 )                       /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P3                 ( 0x1u << 3 )                       /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P4                 ( 0x1u << 4 )                       /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P5                 ( 0x1u << 5 )                       /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P6                 ( 0x1u << 6 )                       /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P7                 ( 0x1u << 7 )                       /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P8                 ( 0x1u << 8 )                       /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P9                 ( 0x1u << 9 )                       /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P10                ( 0x1u << 10 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P11                ( 0x1u << 11 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P12                ( 0x1u << 12 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P13                ( 0x1u << 13 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P14                ( 0x1u << 14 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P15                ( 0x1u << 15 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P16                ( 0x1u << 16 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P17                ( 0x1u << 17 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P18                ( 0x1u << 18 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P19                ( 0x1u << 19 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P20                ( 0x1u << 20 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P21                ( 0x1u << 21 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P22                ( 0x1u << 22 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P23                ( 0x1u << 23 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P24                ( 0x1u << 24 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P25                ( 0x1u << 25 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P26                ( 0x1u << 26 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P27                ( 0x1u << 27 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P28                ( 0x1u << 28 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P29                ( 0x1u << 29 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P30                ( 0x1u << 30 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
#define PIO_PPDER_P31                ( 0x1u << 31 )                      /**< \brief (PIO_PPDER) Pull-Down Enable */
/* -------- PIO_PPDSR : (PIO Offset: 0x0098) Pad Pull-down Status Register -------- */
#define PIO_PPDSR_P0                 ( 0x1u << 0 )                       /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P1                 ( 0x1u << 1 )                       /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P2                 ( 0x1u << 2 )                       /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P3                 ( 0x1u << 3 )                       /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P4                 ( 0x1u << 4 )                       /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P5                 ( 0x1u << 5 )                       /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P6                 ( 0x1u << 6 )                       /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P7                 ( 0x1u << 7 )                       /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P8                 ( 0x1u << 8 )                       /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P9                 ( 0x1u << 9 )                       /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P10                ( 0x1u << 10 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P11                ( 0x1u << 11 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P12                ( 0x1u << 12 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P13                ( 0x1u << 13 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P14                ( 0x1u << 14 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P15                ( 0x1u << 15 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P16                ( 0x1u << 16 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P17                ( 0x1u << 17 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P18                ( 0x1u << 18 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P19                ( 0x1u << 19 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P20                ( 0x1u << 20 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P21                ( 0x1u << 21 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P22                ( 0x1u << 22 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P23                ( 0x1u << 23 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P24                ( 0x1u << 24 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P25                ( 0x1u << 25 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P26                ( 0x1u << 26 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P27                ( 0x1u << 27 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P28                ( 0x1u << 28 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P29                ( 0x1u << 29 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P30                ( 0x1u << 30 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
#define PIO_PPDSR_P31                ( 0x1u << 31 )                      /**< \brief (PIO_PPDSR) Pull-Down Status */
/* -------- PIO_OWER : (PIO Offset: 0x00A0) Output Write Enable -------- */
#define PIO_OWER_P0                  ( 0x1u << 0 )                       /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P1                  ( 0x1u << 1 )                       /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P2                  ( 0x1u << 2 )                       /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P3                  ( 0x1u << 3 )                       /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P4                  ( 0x1u << 4 )                       /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P5                  ( 0x1u << 5 )                       /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P6                  ( 0x1u << 6 )                       /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P7                  ( 0x1u << 7 )                       /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P8                  ( 0x1u << 8 )                       /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P9                  ( 0x1u << 9 )                       /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P10                 ( 0x1u << 10 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P11                 ( 0x1u << 11 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P12                 ( 0x1u << 12 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P13                 ( 0x1u << 13 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P14                 ( 0x1u << 14 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P15                 ( 0x1u << 15 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P16                 ( 0x1u << 16 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P17                 ( 0x1u << 17 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P18                 ( 0x1u << 18 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P19                 ( 0x1u << 19 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P20                 ( 0x1u << 20 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P21                 ( 0x1u << 21 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P22                 ( 0x1u << 22 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P23                 ( 0x1u << 23 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P24                 ( 0x1u << 24 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P25                 ( 0x1u << 25 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P26                 ( 0x1u << 26 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P27                 ( 0x1u << 27 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P28                 ( 0x1u << 28 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P29                 ( 0x1u << 29 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P30                 ( 0x1u << 30 )                      /**< \brief (PIO_OWER) Output Write Enable */
#define PIO_OWER_P31                 ( 0x1u << 31 )                      /**< \brief (PIO_OWER) Output Write Enable */
/* -------- PIO_OWDR : (PIO Offset: 0x00A4) Output Write Disable -------- */
#define PIO_OWDR_P0                  ( 0x1u << 0 )                       /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P1                  ( 0x1u << 1 )                       /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P2                  ( 0x1u << 2 )                       /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P3                  ( 0x1u << 3 )                       /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P4                  ( 0x1u << 4 )                       /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P5                  ( 0x1u << 5 )                       /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P6                  ( 0x1u << 6 )                       /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P7                  ( 0x1u << 7 )                       /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P8                  ( 0x1u << 8 )                       /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P9                  ( 0x1u << 9 )                       /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P10                 ( 0x1u << 10 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P11                 ( 0x1u << 11 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P12                 ( 0x1u << 12 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P13                 ( 0x1u << 13 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P14                 ( 0x1u << 14 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P15                 ( 0x1u << 15 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P16                 ( 0x1u << 16 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P17                 ( 0x1u << 17 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P18                 ( 0x1u << 18 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P19                 ( 0x1u << 19 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P20                 ( 0x1u << 20 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P21                 ( 0x1u << 21 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P22                 ( 0x1u << 22 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P23                 ( 0x1u << 23 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P24                 ( 0x1u << 24 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P25                 ( 0x1u << 25 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P26                 ( 0x1u << 26 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P27                 ( 0x1u << 27 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P28                 ( 0x1u << 28 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P29                 ( 0x1u << 29 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P30                 ( 0x1u << 30 )                      /**< \brief (PIO_OWDR) Output Write Disable */
#define PIO_OWDR_P31                 ( 0x1u << 31 )                      /**< \brief (PIO_OWDR) Output Write Disable */
/* -------- PIO_OWSR : (PIO Offset: 0x00A8) Output Write Status Register -------- */
#define PIO_OWSR_P0                  ( 0x1u << 0 )                       /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P1                  ( 0x1u << 1 )                       /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P2                  ( 0x1u << 2 )                       /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P3                  ( 0x1u << 3 )                       /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P4                  ( 0x1u << 4 )                       /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P5                  ( 0x1u << 5 )                       /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P6                  ( 0x1u << 6 )                       /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P7                  ( 0x1u << 7 )                       /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P8                  ( 0x1u << 8 )                       /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P9                  ( 0x1u << 9 )                       /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P10                 ( 0x1u << 10 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P11                 ( 0x1u << 11 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P12                 ( 0x1u << 12 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P13                 ( 0x1u << 13 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P14                 ( 0x1u << 14 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P15                 ( 0x1u << 15 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P16                 ( 0x1u << 16 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P17                 ( 0x1u << 17 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P18                 ( 0x1u << 18 )                      /**< \brief (PIO_OWSR) Output Write Status */
