FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_pio.h
#define PIO_OWSR_P19                 ( 0x1u << 19 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P20                 ( 0x1u << 20 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P21                 ( 0x1u << 21 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P22                 ( 0x1u << 22 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P23                 ( 0x1u << 23 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P24                 ( 0x1u << 24 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P25                 ( 0x1u << 25 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P26                 ( 0x1u << 26 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P27                 ( 0x1u << 27 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P28                 ( 0x1u << 28 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P29                 ( 0x1u << 29 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P30                 ( 0x1u << 30 )                      /**< \brief (PIO_OWSR) Output Write Status */
#define PIO_OWSR_P31                 ( 0x1u << 31 )                      /**< \brief (PIO_OWSR) Output Write Status */
/* -------- PIO_AIMER : (PIO Offset: 0x00B0) Additional Interrupt Modes Enable Register -------- */
#define PIO_AIMER_P0                 ( 0x1u << 0 )                       /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P1                 ( 0x1u << 1 )                       /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P2                 ( 0x1u << 2 )                       /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P3                 ( 0x1u << 3 )                       /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P4                 ( 0x1u << 4 )                       /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P5                 ( 0x1u << 5 )                       /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P6                 ( 0x1u << 6 )                       /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P7                 ( 0x1u << 7 )                       /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P8                 ( 0x1u << 8 )                       /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P9                 ( 0x1u << 9 )                       /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P10                ( 0x1u << 10 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P11                ( 0x1u << 11 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P12                ( 0x1u << 12 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P13                ( 0x1u << 13 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P14                ( 0x1u << 14 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P15                ( 0x1u << 15 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P16                ( 0x1u << 16 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P17                ( 0x1u << 17 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P18                ( 0x1u << 18 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P19                ( 0x1u << 19 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P20                ( 0x1u << 20 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P21                ( 0x1u << 21 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P22                ( 0x1u << 22 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P23                ( 0x1u << 23 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P24                ( 0x1u << 24 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P25                ( 0x1u << 25 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P26                ( 0x1u << 26 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P27                ( 0x1u << 27 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P28                ( 0x1u << 28 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P29                ( 0x1u << 29 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P30                ( 0x1u << 30 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
#define PIO_AIMER_P31                ( 0x1u << 31 )                      /**< \brief (PIO_AIMER) Additional Interrupt Modes Enable */
/* -------- PIO_AIMDR : (PIO Offset: 0x00B4) Additional Interrupt Modes Disable Register -------- */
#define PIO_AIMDR_P0                 ( 0x1u << 0 )                       /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P1                 ( 0x1u << 1 )                       /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P2                 ( 0x1u << 2 )                       /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P3                 ( 0x1u << 3 )                       /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P4                 ( 0x1u << 4 )                       /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P5                 ( 0x1u << 5 )                       /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P6                 ( 0x1u << 6 )                       /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P7                 ( 0x1u << 7 )                       /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P8                 ( 0x1u << 8 )                       /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P9                 ( 0x1u << 9 )                       /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P10                ( 0x1u << 10 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P11                ( 0x1u << 11 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P12                ( 0x1u << 12 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P13                ( 0x1u << 13 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P14                ( 0x1u << 14 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P15                ( 0x1u << 15 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P16                ( 0x1u << 16 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P17                ( 0x1u << 17 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P18                ( 0x1u << 18 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P19                ( 0x1u << 19 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P20                ( 0x1u << 20 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P21                ( 0x1u << 21 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P22                ( 0x1u << 22 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P23                ( 0x1u << 23 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P24                ( 0x1u << 24 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P25                ( 0x1u << 25 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P26                ( 0x1u << 26 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P27                ( 0x1u << 27 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P28                ( 0x1u << 28 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P29                ( 0x1u << 29 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P30                ( 0x1u << 30 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
#define PIO_AIMDR_P31                ( 0x1u << 31 )                      /**< \brief (PIO_AIMDR) Additional Interrupt Modes Disable */
/* -------- PIO_AIMMR : (PIO Offset: 0x00B8) Additional Interrupt Modes Mask Register -------- */
#define PIO_AIMMR_P0                 ( 0x1u << 0 )                       /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P1                 ( 0x1u << 1 )                       /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P2                 ( 0x1u << 2 )                       /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P3                 ( 0x1u << 3 )                       /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P4                 ( 0x1u << 4 )                       /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P5                 ( 0x1u << 5 )                       /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P6                 ( 0x1u << 6 )                       /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P7                 ( 0x1u << 7 )                       /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P8                 ( 0x1u << 8 )                       /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P9                 ( 0x1u << 9 )                       /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P10                ( 0x1u << 10 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P11                ( 0x1u << 11 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P12                ( 0x1u << 12 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P13                ( 0x1u << 13 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P14                ( 0x1u << 14 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P15                ( 0x1u << 15 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P16                ( 0x1u << 16 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P17                ( 0x1u << 17 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P18                ( 0x1u << 18 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P19                ( 0x1u << 19 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P20                ( 0x1u << 20 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P21                ( 0x1u << 21 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P22                ( 0x1u << 22 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P23                ( 0x1u << 23 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P24                ( 0x1u << 24 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P25                ( 0x1u << 25 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P26                ( 0x1u << 26 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P27                ( 0x1u << 27 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P28                ( 0x1u << 28 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P29                ( 0x1u << 29 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P30                ( 0x1u << 30 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
#define PIO_AIMMR_P31                ( 0x1u << 31 )                      /**< \brief (PIO_AIMMR) Peripheral CD Status */
/* -------- PIO_ESR : (PIO Offset: 0x00C0) Edge Select Register -------- */
#define PIO_ESR_P0                   ( 0x1u << 0 )                       /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P1                   ( 0x1u << 1 )                       /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P2                   ( 0x1u << 2 )                       /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P3                   ( 0x1u << 3 )                       /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P4                   ( 0x1u << 4 )                       /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P5                   ( 0x1u << 5 )                       /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P6                   ( 0x1u << 6 )                       /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P7                   ( 0x1u << 7 )                       /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P8                   ( 0x1u << 8 )                       /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P9                   ( 0x1u << 9 )                       /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P10                  ( 0x1u << 10 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P11                  ( 0x1u << 11 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P12                  ( 0x1u << 12 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P13                  ( 0x1u << 13 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P14                  ( 0x1u << 14 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P15                  ( 0x1u << 15 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P16                  ( 0x1u << 16 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P17                  ( 0x1u << 17 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P18                  ( 0x1u << 18 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P19                  ( 0x1u << 19 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P20                  ( 0x1u << 20 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P21                  ( 0x1u << 21 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P22                  ( 0x1u << 22 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P23                  ( 0x1u << 23 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P24                  ( 0x1u << 24 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P25                  ( 0x1u << 25 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P26                  ( 0x1u << 26 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P27                  ( 0x1u << 27 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P28                  ( 0x1u << 28 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P29                  ( 0x1u << 29 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P30                  ( 0x1u << 30 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
#define PIO_ESR_P31                  ( 0x1u << 31 )                      /**< \brief (PIO_ESR) Edge Interrupt Selection */
/* -------- PIO_LSR : (PIO Offset: 0x00C4) Level Select Register -------- */
#define PIO_LSR_P0                   ( 0x1u << 0 )                       /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P1                   ( 0x1u << 1 )                       /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P2                   ( 0x1u << 2 )                       /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P3                   ( 0x1u << 3 )                       /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P4                   ( 0x1u << 4 )                       /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P5                   ( 0x1u << 5 )                       /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P6                   ( 0x1u << 6 )                       /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P7                   ( 0x1u << 7 )                       /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P8                   ( 0x1u << 8 )                       /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P9                   ( 0x1u << 9 )                       /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P10                  ( 0x1u << 10 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P11                  ( 0x1u << 11 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P12                  ( 0x1u << 12 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P13                  ( 0x1u << 13 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P14                  ( 0x1u << 14 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P15                  ( 0x1u << 15 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P16                  ( 0x1u << 16 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P17                  ( 0x1u << 17 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P18                  ( 0x1u << 18 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P19                  ( 0x1u << 19 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P20                  ( 0x1u << 20 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P21                  ( 0x1u << 21 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P22                  ( 0x1u << 22 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P23                  ( 0x1u << 23 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P24                  ( 0x1u << 24 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P25                  ( 0x1u << 25 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P26                  ( 0x1u << 26 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P27                  ( 0x1u << 27 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P28                  ( 0x1u << 28 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P29                  ( 0x1u << 29 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P30                  ( 0x1u << 30 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
#define PIO_LSR_P31                  ( 0x1u << 31 )                      /**< \brief (PIO_LSR) Level Interrupt Selection */
/* -------- PIO_ELSR : (PIO Offset: 0x00C8) Edge/Level Status Register -------- */
#define PIO_ELSR_P0                  ( 0x1u << 0 )                       /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P1                  ( 0x1u << 1 )                       /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P2                  ( 0x1u << 2 )                       /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P3                  ( 0x1u << 3 )                       /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P4                  ( 0x1u << 4 )                       /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P5                  ( 0x1u << 5 )                       /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P6                  ( 0x1u << 6 )                       /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P7                  ( 0x1u << 7 )                       /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P8                  ( 0x1u << 8 )                       /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P9                  ( 0x1u << 9 )                       /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P10                 ( 0x1u << 10 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
