FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_pio.h
#define PIO_ELSR_P11                 ( 0x1u << 11 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P12                 ( 0x1u << 12 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P13                 ( 0x1u << 13 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P14                 ( 0x1u << 14 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P15                 ( 0x1u << 15 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P16                 ( 0x1u << 16 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P17                 ( 0x1u << 17 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P18                 ( 0x1u << 18 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P19                 ( 0x1u << 19 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P20                 ( 0x1u << 20 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P21                 ( 0x1u << 21 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P22                 ( 0x1u << 22 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P23                 ( 0x1u << 23 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P24                 ( 0x1u << 24 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P25                 ( 0x1u << 25 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P26                 ( 0x1u << 26 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P27                 ( 0x1u << 27 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P28                 ( 0x1u << 28 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P29                 ( 0x1u << 29 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P30                 ( 0x1u << 30 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
#define PIO_ELSR_P31                 ( 0x1u << 31 )                      /**< \brief (PIO_ELSR) Edge/Level Interrupt Source Selection */
/* -------- PIO_FELLSR : (PIO Offset: 0x00D0) Falling Edge/Low-Level Select Register -------- */
#define PIO_FELLSR_P0                ( 0x1u << 0 )                       /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P1                ( 0x1u << 1 )                       /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P2                ( 0x1u << 2 )                       /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P3                ( 0x1u << 3 )                       /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P4                ( 0x1u << 4 )                       /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P5                ( 0x1u << 5 )                       /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P6                ( 0x1u << 6 )                       /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P7                ( 0x1u << 7 )                       /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P8                ( 0x1u << 8 )                       /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P9                ( 0x1u << 9 )                       /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P10               ( 0x1u << 10 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P11               ( 0x1u << 11 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P12               ( 0x1u << 12 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P13               ( 0x1u << 13 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P14               ( 0x1u << 14 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P15               ( 0x1u << 15 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P16               ( 0x1u << 16 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P17               ( 0x1u << 17 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P18               ( 0x1u << 18 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P19               ( 0x1u << 19 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P20               ( 0x1u << 20 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P21               ( 0x1u << 21 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P22               ( 0x1u << 22 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P23               ( 0x1u << 23 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P24               ( 0x1u << 24 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P25               ( 0x1u << 25 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P26               ( 0x1u << 26 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P27               ( 0x1u << 27 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P28               ( 0x1u << 28 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P29               ( 0x1u << 29 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P30               ( 0x1u << 30 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
#define PIO_FELLSR_P31               ( 0x1u << 31 )                      /**< \brief (PIO_FELLSR) Falling Edge/Low-Level Interrupt Selection */
/* -------- PIO_REHLSR : (PIO Offset: 0x00D4) Rising Edge/ High-Level Select Register -------- */
#define PIO_REHLSR_P0                ( 0x1u << 0 )                       /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P1                ( 0x1u << 1 )                       /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P2                ( 0x1u << 2 )                       /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P3                ( 0x1u << 3 )                       /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P4                ( 0x1u << 4 )                       /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P5                ( 0x1u << 5 )                       /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P6                ( 0x1u << 6 )                       /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P7                ( 0x1u << 7 )                       /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P8                ( 0x1u << 8 )                       /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P9                ( 0x1u << 9 )                       /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P10               ( 0x1u << 10 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P11               ( 0x1u << 11 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P12               ( 0x1u << 12 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P13               ( 0x1u << 13 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P14               ( 0x1u << 14 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P15               ( 0x1u << 15 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P16               ( 0x1u << 16 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P17               ( 0x1u << 17 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P18               ( 0x1u << 18 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P19               ( 0x1u << 19 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P20               ( 0x1u << 20 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P21               ( 0x1u << 21 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P22               ( 0x1u << 22 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P23               ( 0x1u << 23 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P24               ( 0x1u << 24 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P25               ( 0x1u << 25 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P26               ( 0x1u << 26 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P27               ( 0x1u << 27 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P28               ( 0x1u << 28 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P29               ( 0x1u << 29 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P30               ( 0x1u << 30 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
#define PIO_REHLSR_P31               ( 0x1u << 31 )                      /**< \brief (PIO_REHLSR) Rising Edge /High-Level Interrupt Selection */
/* -------- PIO_FRLHSR : (PIO Offset: 0x00D8) Fall/Rise - Low/High Status Register -------- */
#define PIO_FRLHSR_P0                ( 0x1u << 0 )                       /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P1                ( 0x1u << 1 )                       /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P2                ( 0x1u << 2 )                       /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P3                ( 0x1u << 3 )                       /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P4                ( 0x1u << 4 )                       /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P5                ( 0x1u << 5 )                       /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P6                ( 0x1u << 6 )                       /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P7                ( 0x1u << 7 )                       /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P8                ( 0x1u << 8 )                       /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P9                ( 0x1u << 9 )                       /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P10               ( 0x1u << 10 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P11               ( 0x1u << 11 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P12               ( 0x1u << 12 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P13               ( 0x1u << 13 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P14               ( 0x1u << 14 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P15               ( 0x1u << 15 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P16               ( 0x1u << 16 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P17               ( 0x1u << 17 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P18               ( 0x1u << 18 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P19               ( 0x1u << 19 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P20               ( 0x1u << 20 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P21               ( 0x1u << 21 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P22               ( 0x1u << 22 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P23               ( 0x1u << 23 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P24               ( 0x1u << 24 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P25               ( 0x1u << 25 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P26               ( 0x1u << 26 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P27               ( 0x1u << 27 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P28               ( 0x1u << 28 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P29               ( 0x1u << 29 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P30               ( 0x1u << 30 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
#define PIO_FRLHSR_P31               ( 0x1u << 31 )                      /**< \brief (PIO_FRLHSR) Edge /Level Interrupt Source Selection */
/* -------- PIO_LOCKSR : (PIO Offset: 0x00E0) Lock Status -------- */
#define PIO_LOCKSR_P0                ( 0x1u << 0 )                       /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P1                ( 0x1u << 1 )                       /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P2                ( 0x1u << 2 )                       /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P3                ( 0x1u << 3 )                       /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P4                ( 0x1u << 4 )                       /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P5                ( 0x1u << 5 )                       /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P6                ( 0x1u << 6 )                       /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P7                ( 0x1u << 7 )                       /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P8                ( 0x1u << 8 )                       /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P9                ( 0x1u << 9 )                       /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P10               ( 0x1u << 10 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P11               ( 0x1u << 11 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P12               ( 0x1u << 12 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P13               ( 0x1u << 13 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P14               ( 0x1u << 14 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P15               ( 0x1u << 15 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P16               ( 0x1u << 16 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P17               ( 0x1u << 17 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P18               ( 0x1u << 18 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P19               ( 0x1u << 19 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P20               ( 0x1u << 20 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P21               ( 0x1u << 21 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P22               ( 0x1u << 22 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P23               ( 0x1u << 23 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P24               ( 0x1u << 24 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P25               ( 0x1u << 25 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P26               ( 0x1u << 26 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P27               ( 0x1u << 27 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P28               ( 0x1u << 28 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P29               ( 0x1u << 29 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P30               ( 0x1u << 30 )                      /**< \brief (PIO_LOCKSR) Lock Status */
#define PIO_LOCKSR_P31               ( 0x1u << 31 )                      /**< \brief (PIO_LOCKSR) Lock Status */
/* -------- PIO_WPMR : (PIO Offset: 0x00E4) Write Protection Mode Register -------- */
#define PIO_WPMR_WPEN                ( 0x1u << 0 )                       /**< \brief (PIO_WPMR) Write Protection Enable */
#define PIO_WPMR_WPKEY_Pos           8
#define PIO_WPMR_WPKEY_Msk           ( 0xffffffu << PIO_WPMR_WPKEY_Pos ) /**< \brief (PIO_WPMR) Write Protection Key. */
#define   PIO_WPMR_WPKEY_PASSWD      ( 0x50494Fu << 8 )                  /**< \brief (PIO_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. */
/* -------- PIO_WPSR : (PIO Offset: 0x00E8) Write Protection Status Register -------- */
#define PIO_WPSR_WPVS                ( 0x1u << 0 )                       /**< \brief (PIO_WPSR) Write Protection Violation Status */
#define PIO_WPSR_WPVSRC_Pos          8
#define PIO_WPSR_WPVSRC_Msk          ( 0xffffu << PIO_WPSR_WPVSRC_Pos )  /**< \brief (PIO_WPSR) Write Protection Violation Source */
/* -------- PIO_VERSION : (PIO Offset: 0x00FC) Version Register -------- */
#define PIO_VERSION_VERSION_Pos      0
#define PIO_VERSION_VERSION_Msk      ( 0xfffu << PIO_VERSION_VERSION_Pos ) /**< \brief (PIO_VERSION) Hardware Module Version */
#define PIO_VERSION_MFN_Pos          16
#define PIO_VERSION_MFN_Msk          ( 0x7u << PIO_VERSION_MFN_Pos )       /**< \brief (PIO_VERSION) Metal Fix Number */
/* -------- PIO_SCHMITT : (PIO Offset: 0x0100) Schmitt Trigger Register -------- */
#define PIO_SCHMITT_SCHMITT0         ( 0x1u << 0 )                         /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT1         ( 0x1u << 1 )                         /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT2         ( 0x1u << 2 )                         /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT3         ( 0x1u << 3 )                         /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT4         ( 0x1u << 4 )                         /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT5         ( 0x1u << 5 )                         /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT6         ( 0x1u << 6 )                         /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT7         ( 0x1u << 7 )                         /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT8         ( 0x1u << 8 )                         /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT9         ( 0x1u << 9 )                         /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT10        ( 0x1u << 10 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT11        ( 0x1u << 11 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT12        ( 0x1u << 12 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT13        ( 0x1u << 13 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT14        ( 0x1u << 14 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
