FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_pio.h
#define PIO_SCHMITT_SCHMITT15        ( 0x1u << 15 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT16        ( 0x1u << 16 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT17        ( 0x1u << 17 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT18        ( 0x1u << 18 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT19        ( 0x1u << 19 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT20        ( 0x1u << 20 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT21        ( 0x1u << 21 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT22        ( 0x1u << 22 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT23        ( 0x1u << 23 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT24        ( 0x1u << 24 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT25        ( 0x1u << 25 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT26        ( 0x1u << 26 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT27        ( 0x1u << 27 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT28        ( 0x1u << 28 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT29        ( 0x1u << 29 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT30        ( 0x1u << 30 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
#define PIO_SCHMITT_SCHMITT31        ( 0x1u << 31 )                        /**< \brief (PIO_SCHMITT) Schmitt Trigger Control */
/* -------- PIO_KER : (PIO Offset: 0x0120) Keypad Controller Enable Register -------- */
#define PIO_KER_KCE                  ( 0x1u << 0 )                         /**< \brief (PIO_KER) Keypad Controller Enable */
/* -------- PIO_KRCR : (PIO Offset: 0x0124) Keypad Controller Row Column Register -------- */
#define PIO_KRCR_NBR_Pos             0
#define PIO_KRCR_NBR_Msk             ( 0x7u << PIO_KRCR_NBR_Pos ) /**< \brief (PIO_KRCR) Number of Columns of the Keypad Matrix */
#define PIO_KRCR_NBR( value )    ( ( PIO_KRCR_NBR_Msk & ( ( value ) << PIO_KRCR_NBR_Pos ) ) )
#define PIO_KRCR_NBC_Pos             8
#define PIO_KRCR_NBC_Msk             ( 0x7u << PIO_KRCR_NBC_Pos ) /**< \brief (PIO_KRCR) Number of Rows of the Keypad Matrix */
#define PIO_KRCR_NBC( value )    ( ( PIO_KRCR_NBC_Msk & ( ( value ) << PIO_KRCR_NBC_Pos ) ) )
/* -------- PIO_KDR : (PIO Offset: 0x0128) Keypad Controller Debouncing Register -------- */
#define PIO_KDR_DBC_Pos              0
#define PIO_KDR_DBC_Msk              ( 0x3ffu << PIO_KDR_DBC_Pos ) /**< \brief (PIO_KDR) Debouncing Value */
#define PIO_KDR_DBC( value )    ( ( PIO_KDR_DBC_Msk & ( ( value ) << PIO_KDR_DBC_Pos ) ) )
/* -------- PIO_KIER : (PIO Offset: 0x0130) Keypad Controller Interrupt Enable Register -------- */
#define PIO_KIER_KPR                 ( 0x1u << 0 )                 /**< \brief (PIO_KIER) Key Press Interrupt Enable */
#define PIO_KIER_KRL                 ( 0x1u << 1 )                 /**< \brief (PIO_KIER) Key Release Interrupt Enable */
/* -------- PIO_KIDR : (PIO Offset: 0x0134) Keypad Controller Interrupt Disable Register -------- */
#define PIO_KIDR_KPR                 ( 0x1u << 0 )                 /**< \brief (PIO_KIDR) Key Press Interrupt Disable */
#define PIO_KIDR_KRL                 ( 0x1u << 1 )                 /**< \brief (PIO_KIDR) Key Release Interrupt Disable */
/* -------- PIO_KIMR : (PIO Offset: 0x0138) Keypad Controller Interrupt Mask Register -------- */
#define PIO_KIMR_KPR                 ( 0x1u << 0 )                 /**< \brief (PIO_KIMR) Key Press Interrupt Mask */
#define PIO_KIMR_KRL                 ( 0x1u << 1 )                 /**< \brief (PIO_KIMR) Key Release Interrupt Mask */
/* -------- PIO_KSR : (PIO Offset: 0x013C) Keypad Controller Status Register -------- */
#define PIO_KSR_KPR                  ( 0x1u << 0 )                 /**< \brief (PIO_KSR) Key Press Status */
#define PIO_KSR_KRL                  ( 0x1u << 1 )                 /**< \brief (PIO_KSR) Key Release Status */
#define PIO_KSR_NBKPR_Pos            8
#define PIO_KSR_NBKPR_Msk            ( 0x3u << PIO_KSR_NBKPR_Pos ) /**< \brief (PIO_KSR) Number of Simultaneous Key Presses */
#define PIO_KSR_NBKRL_Pos            16
#define PIO_KSR_NBKRL_Msk            ( 0x3u << PIO_KSR_NBKRL_Pos ) /**< \brief (PIO_KSR) Number of Simultaneous Key Releases */
/* -------- PIO_KKPR : (PIO Offset: 0x0140) Keypad Controller Key Press Register -------- */
#define PIO_KKPR_KEY0ROW_Pos         0
#define PIO_KKPR_KEY0ROW_Msk         ( 0x7u << PIO_KKPR_KEY0ROW_Pos ) /**< \brief (PIO_KKPR) Row Index of the First Detected Key Press */
#define PIO_KKPR_KEY0COL_Pos         4
#define PIO_KKPR_KEY0COL_Msk         ( 0x7u << PIO_KKPR_KEY0COL_Pos ) /**< \brief (PIO_KKPR) Column Index of the First Detected Key Press */
#define PIO_KKPR_KEY1ROW_Pos         8
#define PIO_KKPR_KEY1ROW_Msk         ( 0x7u << PIO_KKPR_KEY1ROW_Pos ) /**< \brief (PIO_KKPR) Row Index of the Second Detected Key Press */
#define PIO_KKPR_KEY1COL_Pos         12
#define PIO_KKPR_KEY1COL_Msk         ( 0x7u << PIO_KKPR_KEY1COL_Pos ) /**< \brief (PIO_KKPR) Column Index of the Second Detected Key Press */
#define PIO_KKPR_KEY2ROW_Pos         16
#define PIO_KKPR_KEY2ROW_Msk         ( 0x7u << PIO_KKPR_KEY2ROW_Pos ) /**< \brief (PIO_KKPR) Row Index of the Third Detected Key Press */
#define PIO_KKPR_KEY2COL_Pos         20
#define PIO_KKPR_KEY2COL_Msk         ( 0x7u << PIO_KKPR_KEY2COL_Pos ) /**< \brief (PIO_KKPR) Column Index of the Third Detected Key Press */
#define PIO_KKPR_KEY3ROW_Pos         24
#define PIO_KKPR_KEY3ROW_Msk         ( 0x7u << PIO_KKPR_KEY3ROW_Pos ) /**< \brief (PIO_KKPR) Row Index of the Fourth Detected Key Press */
#define PIO_KKPR_KEY3COL_Pos         28
#define PIO_KKPR_KEY3COL_Msk         ( 0x7u << PIO_KKPR_KEY3COL_Pos ) /**< \brief (PIO_KKPR) Column Index of the Fourth Detected Key Press */
/* -------- PIO_KKRR : (PIO Offset: 0x0144) Keypad Controller Key Release Register -------- */
#define PIO_KKRR_KEY0ROW_Pos         0
#define PIO_KKRR_KEY0ROW_Msk         ( 0x7u << PIO_KKRR_KEY0ROW_Pos ) /**< \brief (PIO_KKRR) Row Index of the First Detected Key Release */
#define PIO_KKRR_KEY0COL_Pos         4
#define PIO_KKRR_KEY0COL_Msk         ( 0x7u << PIO_KKRR_KEY0COL_Pos ) /**< \brief (PIO_KKRR) Column Index of the First Detected Key Release */
#define PIO_KKRR_KEY1ROW_Pos         8
#define PIO_KKRR_KEY1ROW_Msk         ( 0x7u << PIO_KKRR_KEY1ROW_Pos ) /**< \brief (PIO_KKRR) Row Index of the Second Detected Key Release */
#define PIO_KKRR_KEY1COL_Pos         12
#define PIO_KKRR_KEY1COL_Msk         ( 0x7u << PIO_KKRR_KEY1COL_Pos ) /**< \brief (PIO_KKRR) Column Index of the Second Detected Key Release */
#define PIO_KKRR_KEY2ROW_Pos         16
#define PIO_KKRR_KEY2ROW_Msk         ( 0x7u << PIO_KKRR_KEY2ROW_Pos ) /**< \brief (PIO_KKRR) Row Index of the Third Detected Key Release */
#define PIO_KKRR_KEY2COL_Pos         20
#define PIO_KKRR_KEY2COL_Msk         ( 0x7u << PIO_KKRR_KEY2COL_Pos ) /**< \brief (PIO_KKRR) Column Index of the Third Detected Key Release */
#define PIO_KKRR_KEY3ROW_Pos         24
#define PIO_KKRR_KEY3ROW_Msk         ( 0x7u << PIO_KKRR_KEY3ROW_Pos ) /**< \brief (PIO_KKRR) Row Index of the Fourth Detected Key Release */
#define PIO_KKRR_KEY3COL_Pos         28
#define PIO_KKRR_KEY3COL_Msk         ( 0x7u << PIO_KKRR_KEY3COL_Pos ) /**< \brief (PIO_KKRR) Column Index of the Fourth Detected Key Release */
/* -------- PIO_PCMR : (PIO Offset: 0x150) Parallel Capture Mode Register -------- */
#define PIO_PCMR_PCEN                ( 0x1u << 0 )                    /**< \brief (PIO_PCMR) Parallel Capture Mode Enable */
#define PIO_PCMR_DSIZE_Pos           4
#define PIO_PCMR_DSIZE_Msk           ( 0x3u << PIO_PCMR_DSIZE_Pos )   /**< \brief (PIO_PCMR) Parallel Capture Mode Data Size */
#define   PIO_PCMR_DSIZE_BYTE        ( 0x0u << 4 )                    /**< \brief (PIO_PCMR) The reception data in the PIO_PCRHR is a byte (8-bit) */
#define   PIO_PCMR_DSIZE_HALFWORD    ( 0x1u << 4 )                    /**< \brief (PIO_PCMR) The reception data in the PIO_PCRHR is a half-word (16-bit) */
#define   PIO_PCMR_DSIZE_WORD        ( 0x2u << 4 )                    /**< \brief (PIO_PCMR) The reception data in the PIO_PCRHR is a word (32-bit) */
#define PIO_PCMR_ALWYS               ( 0x1u << 9 )                    /**< \brief (PIO_PCMR) Parallel Capture Mode Always Sampling */
#define PIO_PCMR_HALFS               ( 0x1u << 10 )                   /**< \brief (PIO_PCMR) Parallel Capture Mode Half Sampling */
#define PIO_PCMR_FRSTS               ( 0x1u << 11 )                   /**< \brief (PIO_PCMR) Parallel Capture Mode First Sample */
/* -------- PIO_PCIER : (PIO Offset: 0x154) Parallel Capture Interrupt Enable Register -------- */
#define PIO_PCIER_DRDY               ( 0x1u << 0 )                    /**< \brief (PIO_PCIER) Parallel Capture Mode Data Ready Interrupt Enable */
#define PIO_PCIER_OVRE               ( 0x1u << 1 )                    /**< \brief (PIO_PCIER) Parallel Capture Mode Overrun Error Interrupt Enable */
#define PIO_PCIER_ENDRX              ( 0x1u << 2 )                    /**< \brief (PIO_PCIER) End of Reception Transfer Interrupt Enable */
#define PIO_PCIER_RXBUFF             ( 0x1u << 3 )                    /**< \brief (PIO_PCIER) Reception Buffer Full Interrupt Enable */
/* -------- PIO_PCIDR : (PIO Offset: 0x158) Parallel Capture Interrupt Disable Register -------- */
#define PIO_PCIDR_DRDY               ( 0x1u << 0 )                    /**< \brief (PIO_PCIDR) Parallel Capture Mode Data Ready Interrupt Disable */
#define PIO_PCIDR_OVRE               ( 0x1u << 1 )                    /**< \brief (PIO_PCIDR) Parallel Capture Mode Overrun Error Interrupt Disable */
#define PIO_PCIDR_ENDRX              ( 0x1u << 2 )                    /**< \brief (PIO_PCIDR) End of Reception Transfer Interrupt Disable */
#define PIO_PCIDR_RXBUFF             ( 0x1u << 3 )                    /**< \brief (PIO_PCIDR) Reception Buffer Full Interrupt Disable */
/* -------- PIO_PCIMR : (PIO Offset: 0x15C) Parallel Capture Interrupt Mask Register -------- */
#define PIO_PCIMR_DRDY               ( 0x1u << 0 )                    /**< \brief (PIO_PCIMR) Parallel Capture Mode Data Ready Interrupt Mask */
#define PIO_PCIMR_OVRE               ( 0x1u << 1 )                    /**< \brief (PIO_PCIMR) Parallel Capture Mode Overrun Error Interrupt Mask */
#define PIO_PCIMR_ENDRX              ( 0x1u << 2 )                    /**< \brief (PIO_PCIMR) End of Reception Transfer Interrupt Mask */
#define PIO_PCIMR_RXBUFF             ( 0x1u << 3 )                    /**< \brief (PIO_PCIMR) Reception Buffer Full Interrupt Mask */
/* -------- PIO_PCISR : (PIO Offset: 0x160) Parallel Capture Interrupt Status Register -------- */
#define PIO_PCISR_DRDY               ( 0x1u << 0 )                    /**< \brief (PIO_PCISR) Parallel Capture Mode Data Ready */
#define PIO_PCISR_OVRE               ( 0x1u << 1 )                    /**< \brief (PIO_PCISR) Parallel Capture Mode Overrun Error. */
#define PIO_PCISR_ENDRX              ( 0x1u << 2 )                    /**< \brief (PIO_PCISR) End of Reception Transfer. */
#define PIO_PCISR_RXBUFF             ( 0x1u << 3 )                    /**< \brief (PIO_PCISR) Reception Buffer Full */
/* -------- PIO_PCRHR : (PIO Offset: 0x164) Parallel Capture Reception Holding Register -------- */
#define PIO_PCRHR_RDATA_Pos          0
#define PIO_PCRHR_RDATA_Msk          ( 0xffffffffu << PIO_PCRHR_RDATA_Pos ) /**< \brief (PIO_PCRHR) Parallel Capture Mode Reception Data. */

/*@}*/


#endif /* _SAM_PIO_COMPONENT_ */
